package fr.leglitcheur.Mdp

class mdpRandom {
    fun mdp() : String {
        val lettre_aleatoire = arrayOf(
        "0","1","2","3","4","5","6","7","8","9",
        "a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
        "A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
        "&","é","\"","'","(","-","è","_","ç","à",")","=","^","$","ù","*",",",";",":","!","²","~","#","{","[","|","`","\\","^","@","]","}","¨","£","%","µ","?",".","/","§","°","+"
     ) 
   var i = 1
   var e = "" 
   while(i != 17){
       e += lettre_aleatoire.random()
       i++
   }
   return e
  }
}  
